Documents/бит_НачислениеЛьготПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеЛьготПоЛицевымСчетам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачислениеПоЛьготам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоНосителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоСемейной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСумм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_НачислениеЛьготПоЛицевымСчетам/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

&Наклиенте
Процедура ЗадатьВопросНаОчисткуТабЧасти(НачальноеЗначение, ВыбранноеЗначение)
	
	Если НачальноеЗначение <> ВыбранноеЗначение Тогда
		
		Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросНаОчисткуТабЧастиЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Наклиенте
Процедура ЗадатьВопросНаОчисткуТабЧастиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Очистить();
	
	Если Объект.СписокЛьгот.Количество() > 0 Тогда
		
		Объект.СписокЛьгот.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.ОбновитьПараметрыЖКХ();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию = ?(Объект.ВводВРучную, Истина, Ложь);			
	Элементы.ЛицевыеСчетаНачислено.ТолькоПросмотр                  = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;
	Элементы.СписокЛьготСуммаЛичной.ТолькоПросмотр                 = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;
	Элементы.СписокЛьготНачисленоСемейной.ТолькоПросмотр           = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;	
	
	// БИТ_ЖКХ 24.08.2016 17:52:31 Начало правки...
	Массив = Новый Массив();
	Массив.Добавить(Тип("СправочникСсылка.бит_Проживающие"));
	ОписаниеТипаПроживающие = Новый ОписаниеТипов(Массив);
	Элементы.СписокЛьготФизЛицо.ОграничениеТипа = ОписаниеТипаПроживающие;
	// БИТ_ЖКХ 24.08.2016 17:52:31 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	УстановитьЗаголовокФормыДокумента();
	
	// БИТ_ЖКХ 13.01.2015{{
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.Группа4.Высота = 0;
		Элементы.Группа4.РастягиватьПоВертикали = Истина; 
		
		Элементы.Страницы.Высота = 0;
		Элементы.Страницы.РастягиватьПоВертикали = Истина; 
		
		Элементы.ЛицевыеСчета.Высота = 0;
		Элементы.ЛицевыеСчета.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;
	// БИТ_ЖКХ 13.01.2015}}
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	иначе	
		
		РассчитатьНачисленияПоЛицевымСчетамНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РассчитатьНачисленияПоЛицевымСчетамНаСервере();
	
	Для Каждого Строка Из Объект.СписокЛьгот Цикл
		
		// БИТ_ЖКХ 06.12.2016 14:07:44 Начало правки... 
		//Строка.СуммаСумм = Окр(Строка.СуммаЛичной,2) + Окр(Строка.НачисленоСемейной,2);
		Строка.СуммаСумм = Строка.СуммаЛичной + Строка.НачисленоСемейной;
		// БИТ_ЖКХ 06.12.2016 14:07:45 Конец правки. 
		
	КонецЦикла;
	
	Для Каждого СтрокаЛС Из Объект.ЛицевыеСчета Цикл
		
		Отбор = Новый Структура;
		
		Отбор.Очистить();
		Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
		Отбор.Вставить("Услуга"     , СтрокаЛС.Услуга);
		
		МассивСтрокЛьгот = Объект.СписокЛьгот.НайтиСтроки(Отбор);
		
		Если МассивСтрокЛьгот.Количество()>1 Тогда
			
			МассивСтрокЛицевыеСчета = Объект.ЛицевыеСчета.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из МассивСтрокЛицевыеСчета Цикл
				
				СуммаСумм = 0;
				
				Для Каждого Строка Из МассивСтрокЛьгот Цикл
					
					СуммаСумм = СуммаСумм + Строка.СуммаСумм;
					
					Строка.Начислено = Строка.СуммаСумм; 
					
				КонецЦикла;
				
				СтрокаЛС.Начислено =  СуммаСумм;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНачисленияЛьготВручную(Команда)
	
	Если НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию Тогда
		
		Объект.ВводВручную = Истина;
		
	Иначе
		
		// Восстановим автоматические движения документа.
		ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьНачисленияЛьготВручнуюЗавершение", ЭтотОбъект), "Ручная корректировка начислений льгот по лицевым счетам отменена. 
		|Восстановить начисления сформированные автоматически?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РедактироватьНачисленияЛьготВручнуюФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНачисленияЛьготВручнуюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОчиститьЛицевыеСчетаНаСервере();
	
	ОчиститьСписокЛьготНаСервере();
	
	РассчитатьНачисленияПоЛицевымСчетамНаСервере();
	
	Объект.ВводВручную = Ложь;
	
	РедактироватьНачисленияЛьготВручнуюФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНачисленияЛьготВручнуюФрагмент()
	
	Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию = ?(Объект.ВводВРучную, Истина, Ложь);
	Элементы.ЛицевыеСчетаНачислено.ТолькоПросмотр                  = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;
	Элементы.СписокЛьготСуммаЛичной.ТолькоПросмотр                 = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;
	Элементы.СписокЛьготНачисленоСемейной.ТолькоПросмотр           = НЕ Элементы.РедактироватьНачисленияЛьготВручную.КнопкаПоУмолчанию;
	
КонецПроцедуры 

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПроверитьНомерДокументаНаСервере();
	
	мКэшЗначений.Дата = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	ЗданиеУлица = ПолучитьЗданиеУлицаНаСервере(Объект.Здание);
	
	Если ЗданиеУлица <> Объект.Улица Тогда
		
		Объект.Здание = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗадатьВопросНаОчисткуТабЧасти(Объект.Улица, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Объект.Улица = ПолучитьЗданиеУлицаНаСервере(Объект.Здание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗадатьВопросНаОчисткуТабЧасти(Объект.Здание,ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// БИТ_ЖКХ 03.03.2016 15:11:45 Начало правки... 
	//Отказ = Истина;
	Отказ = НЕ Объект.ВводВручную;
	// БИТ_ЖКХ 03.03.2016 15:11:46 Конец правки. 
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПередУдалением(Элемент, Отказ)
	
	// БИТ_ЖКХ 03.03.2016 15:11:34 Начало правки... 
	//Отказ = Истина;
	Отказ = НЕ Объект.ВводВручную;
	// БИТ_ЖКХ 03.03.2016 15:11:36 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетАбонентаПриИзменении(Элемент)
	
	СтрокаЭлемент = Элементы.ЛицевыеСчета.ТекущийЭлемент;
	СтрокаПлатеж  = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

// БИТ_ЖКХ 23.05.2017 10:38:07 Начало правки... 
&НаКлиенте
Процедура СписокЛьготСуммаЛичнойПриИзменении(Элемент)
	
	ПриИзмененииСуммыЛьгот("СписокЛьгот");
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЛьготНачисленоСемейнойПриИзменении(Элемент)
	
	ПриИзмененииСуммыЛьгот("СписокЛьгот");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммыЛьгот(ИмяТабЧасти)
	
	СтрокаТаблицы = Элементы[ИмяТабЧасти].ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаТаблицы.Начислено = СтрокаТаблицы.СуммаЛичной + СтрокаТаблицы.НачисленоСемейной;
	СтрокаТаблицы.СуммаСумм = СтрокаТаблицы.Начислено;
	
КонецПроцедуры
// БИТ_ЖКХ 23.05.2017 10:38:09 Конец правки. 


#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	
	КэшированныеЗначения.Вставить("ЭтоНовый"   , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ПроверитьНомерДокументаНаСервере()
	
	// БИТ_ЖКХ_09122013_начало_изменений
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_НачислениеЛьготПоЛицевымСчетам"));
	
	бит_РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ДокументОбъект, мКэшЗначений.Дата);
	
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	// БИТ_ЖКХ_09122013_окончание_изменений
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНачисленияПоЛицевымСчетамНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДокументОбъект.РассчитатьНачисленияПоЛицевымСчетам();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗданиеУлицаНаСервере(Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(Форма)
	
	СтрокаПлатеж       = Форма.Объект.ЛицевыеСчета.НайтиПоИдентификатору(Форма.Элементы.ЛицевыеСчета.ТекущаяСтрока);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "ЛицевыеСчетаСубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "ЛицевыеСчетаСубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"ЛицевыеСчетаСубконто" + Постфикс + "1", 
	"ЛицевыеСчетаСубконто" + Постфикс + "2", 
	"ЛицевыеСчетаСубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛицевыеСчетаНаСервере()
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокЛьготНаСервере()
	
	Если Объект.СписокЛьгот.Количество() > 0 Тогда
		
		Объект.СписокЛьгот.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 16.09.2014
&НаКлиенте
Процедура СписокЛьготПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// БИТ_ЖКХ 03.03.2016 15:12:19 Начало правки... 
	//Отказ = Истина;	
	Отказ = НЕ Объект.ВводВручную;
	// БИТ_ЖКХ 03.03.2016 15:12:21 Конец правки. 
	
КонецПроцедуры
// БИТ_ЖКХ 16.09.2014

// БИТ_ЖКХ 03.03.2016 15:41:49 Начало правки... 
&НаКлиенте
Процедура СписокЛьготПередУдалением(Элемент, Отказ)
	
	//Отказ = Истина;	
	Отказ = НЕ Объект.ВводВручную;
	
КонецПроцедуры
// БИТ_ЖКХ 03.03.2016 15:41:53 Конец правки. 

#КонецОбласти
